Autodesk.Navisworks.Api.Data.DatabaseChangeTypes
Change type

Autodesk.Navisworks.Api.Data.DatabaseChangeTypes.None
No change

Autodesk.Navisworks.Api.Data.DatabaseChangeTypes.Insert
Insert row

Autodesk.Navisworks.Api.Data.DatabaseChangeTypes.Delete
Delete row

Autodesk.Navisworks.Api.Data.DatabaseChangeTypes.Update
Update row

Autodesk.Navisworks.Api.Data.DatabaseChangeTypes.All
All change types